import numpy as np; from scipy.optimize import minimize # подключение библиотеки NumPy для работы с массивами, подключение фунции численной оптимизации
def MLE(pdf, x, p0): # функция оценки параметров методом максимального правдоподобия
    return minimize(lambda p: -np.sum(np.log(pdf(x, p))), p0).x # минимизируем минус логарифм функции правдоподобия, начинаем поиск с начальных значений параметров, получаем найденные значения параметров
def pdf(t, p): # функция плотности нормального распределения 
    mu, s = p # из вектора параметров p выделяем матожилание mu и стандартное отклонение s
    return np.exp(-(t-mu)**2/(2*s**2))/(s*np.sqrt(2*np.pi))  # вычисляем значение плотности нормального распредления N(mu,s²) в точке t
x = np.array(input("Введите выборку через пробел: ").split(), float) # ввод значений выборки
p0 = np.array(input("Введите начальные приближения оценок параметров через пробел: ").split(), float) # ввод начальных приближений параметров mu, s
p_est = MLE(pdf, x, p0) # # передаём в функцию MLE плотность pdf, выборку x и начальные приближения p0, получаем оценки параметров методом маквимального правдоподобия
print(p_est)
